delete
from books;

insert into books (title, author, genre, read)
values ('Властелин колец', 'Дж.Р.Р. Толкиен', 'Роман, Фэнтези', '1'),
       ('Гордость и предубеждение', 'Джейн Остин', 'Любовный роман, Сатира', '1'),
       ('Тёмные начала', 'Филип Пулман', 'Научное фэнтези', '1'),
       ('Автостопом по галактике', 'Дуглас Адамс', 'Роман, Научная фантастика', '1'),
       ('Гарри Поттер и Кубок огня', 'Джоан Роулинг', 'Роман, Эпическое фэнтези', '1'),
       ('Убить пересмешника', 'Харпер Ли', 'Роман, Триллер, Южная готика', '1'),
       ('Винни Пух', 'Алан Александр Милн', 'Детская литература', '0'),
       ('1984', 'Джордж Оруэлл', 'Научная фантастика', '0'),
       ('Лев, колдунья и платяной шкаф', 'Клайв Стэйплз Льюис', 'Роман, Эпическое фэнтези', '1'),
       ('Джейн Эйр', 'Шарлотта Бронте', 'Роман, Любовный роман, Готика', '1'),
       ('Уловка-22', 'Джозеф Хеллер', 'Роман, Сатира, Исторический жанр', '1'),
       ('Грозовой перевал', 'Эмили Бронте', 'Роман, Готика, Трагедия', '1'),
       ('Пение птиц', 'Себастьян Фолкс', 'Роман, Исторический жанр', '1'),
       ('Ребекка', 'Дафна Дюморье', 'Роман, Детектив, Готика', '1'),
       ('Над пропастью во ржи', 'Джером Сэлинджер', 'Роман', '1');
